Tutorials/waveBoundaryLayer/kOmega2006/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform     (8.00903e-6 -1.358e-6 0 8.00903e-6 0 8.00903e-6);

boundaryField
{
 
    bottom
    {
//	 type zeroGradient;  

      type		   kqRWallFunction;

    }
    

       top
    {
 	 type slip;  
      
    }


    frontAndBack
    {
        type            empty;
    }
    
        inlet
    {
      	    type		    zeroGradient;
    }
    
        outlet
    {
      	    type		    zeroGradient;
    }
}

// ************************************************************************* //
