Tutorials/waveBoundaryLayer/kOmega2006/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-09;

boundaryField
{
    top
    {
        type           slip; //fixedValue;
        //value uniform        1e-12;
    }

    bottom
    {
	    type		    zeroGradient;

    }
  
    cyclic1
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
    
    inlet
    {
      	    type		    zeroGradient;
	    // type            fixedValue;
	    //value           uniform 0.0;
    }
    /*
    inlet
      {
	type                groovyBC;
	value               uniform 0; // Initial condition, will only be used until the first time step is complete
	variables           "Um=0.38;T=1.10;Ufc=0.02;kappa=0.4;kN=4.75e-4;";
	fractionExpression  "1"; // "1" here indicate that this is a Dirichlet boundary condition (0 is Neumann BC)
	valueExpression     "0.0005*pow(Ufc/kappa*log(30*0.015/kN)+Um*sin(2*pi/T*time()),2)"; 
    }
    */
    outlet
    {
	    type		    zeroGradient;
    }

}

// ************************************************************************* //
